{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<PAD>": 0,
      "<EOS>": 1,
      "<UNK>": 2,
      "(": 3,
      ")": 4,
      "+": 5,
      ",": 6,
      "-": 7,
      "->": 8,
      "0": 9,
      "1": 10,
      "2": 11,
      "3": 12,
      "4": 13,
      "5": 14,
      "6": 15,
      "7": 16,
      "8": 17,
      "9": 18,
      ":": 19,
      "=": 20,
      "ANALYZE_CONFLICT_BEGIN": 21,
      "ANALYZE_CONFLICT_END": 22,
      "AT_LEVEL": 23,
      "BACKTRACK": 24,
      "BECAUSE": 25,
      "BRANCHING_VARIABLE": 26,
      "CALL": 27,
      "CHECK_VAR": 28,
      "CURRENT_LEVEL_LITS": 29,
      "CURRENT_LEVEL_VARS": 30,
      "EVALUATE_CLAUSE": 31,
      "False": 32,
      "LATEST_ASSIGNED": 33,
      "LEARNED_LIT": 34,
      "LEVELS": 35,
      "LEVEL_UP": 36,
      "NO_CONFLICT": 37,
      "NO_PROPAGATION": 38,
      "N_ASSIGNED": 39,
      "PROPAGATE": 40,
      "QUEUE": 41,
      "READ_ASSIGNMENTS": 42,
      "READ_CLAUSES": 43,
      "READ_CONFLICT_CLAUSE": 44,
      "READ_DECISION_LEVELS": 45,
      "READ_LEARNED_CLAUSE": 46,
      "READ_LEVEL": 47,
      "READ_REASON_CLAUSES": 48,
      "REASON": 49,
      "SAT": 50,
      "SOLVE_BEGIN": 51,
      "SOLVE_END": 52,
      "SOLVE_ITER_END": 53,
      "True": 54,
      "UIP": 55,
      "UNIT_PROPAGATION_BEGIN": 56,
      "UNIT_PROPAGATION_END": 57,
      "UNSAT": 58,
      "WRITE_ASSIGNMENTS": 59,
      "WRITE_CONFLICT_CLAUSE": 60,
      "WRITE_LEARNED_CLAUSE": 61,
      "[": 62,
      "]": 63,
      "analyze_conflict": 64,
      "c": 65,
      "unit_propagate": 66,
      "x": 67,
      "{": 68,
      "}": 69
    },
    "unk_token": "<UNK>"
  }
}